#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/plausibleio/checkly-e2e/runs/run-5Q2a5RK3fQgr5p9J

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
checkly_alert_channel.pagerduty: Refreshing state... [id=149771]
checkly_alert_channel.instatus: Refreshing state... [id=178598]
checkly_alert_channel.instatus_ingestion: Refreshing state... [id=197951]
checkly_check_group.reachability: Refreshing state... [id=376823]
checkly_check.plausible-io-lb-health: Refreshing state... [id=710cbee7-fc11-487d-86e2-b76e5385801e]
checkly_check.plausible-io-api-health: Refreshing state... [id=aa6cf6b9-097b-48f1-8c86-f095e85d1ee3]
checkly_check.ingest-plausible-io-ingestion: Refreshing state... [id=4900f22b-54c1-4d35-aa6e-f2c30ae6dc5a]
checkly_check.plausible-io-tracker-script: Refreshing state... [id=553823a8-c656-4d46-bb47-dcff49e4ca8f]
checkly_check.plausible-io-ingestion: Refreshing state... [id=dca96363-4ea4-4e78-8283-515a5dd7d4c8]
checkly_check.plausible-io-api-health: Drift detected (update)
checkly_check.plausible-io-lb-health: Drift detected (update)
checkly_check.plausible-io-ingestion: Drift detected (update)
checkly_check.ingest-plausible-io-ingestion: Drift detected (update)
checkly_check_group.reachability: Drift detected (update)
checkly_check.plausible-io-tracker-script: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # checkly_check.websocket-plausible-io--health will be created
  + resource "checkly_check" "websocket-plausible-io--health" {
      + activated              = true
      + degraded_response_time = 15000
      + frequency              = 1
      + group_id               = 376823
      + id                     = (known after apply)
      + max_response_time      = 30000
      + name                   = "Check websocket.plausible.io/api/health"
      + type                   = "API"

      + alert_settings (known after apply)

      + request {
          + body_type        = "NONE"
          + follow_redirects = false
          + headers          = (known after apply)
          + ip_family        = "IPv4"
          + method           = "GET"
          + query_parameters = (known after apply)
          + skip_ssl         = false
          + url              = "https://websocket.plausible.io/api/health"
            # (1 unchanged attribute hidden)

          + assertion {
              + comparison = "EQUALS"
              + property   = "$.clickhouse"
              + source     = "JSON_BODY"
              + target     = "ok"
            }
          + assertion {
              + comparison = "EQUALS"
              + property   = "$.postgres"
              + source     = "JSON_BODY"
              + target     = "ok"
            }
          + assertion {
              + comparison = "EQUALS"
              + property   = "$.sites_cache"
              + source     = "JSON_BODY"
              + target     = "ok"
            }

          + basic_auth (known after apply)
        }

      + retry_strategy {
          + base_backoff_seconds = 60
          + max_duration_seconds = 600
          + max_retries          = 2
          + same_region          = true
          + type                 = "FIXED"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @cnkk, Action: `pull_request`*